Revit 2027 API
Leader Properties
The Leader type exposes the following members.
Properties
Name | Description
Anchor |  Anchor point of the Leader
Elbow |  Elbow point of the Leader.
End |  End point of the Leader.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeaderShape |  Geometric style of the leader
Top
See Also
Reference
Leader Class
Autodesk.Revit.DB Namespace